//
//  BugReport.swift
//  YiXinKuaiXiu
//
//  Created by 梁浩 on 16/6/6.
//  Copyright © 2016年 LeungHowell. All rights reserved.
//

import Foundation

/**
 * 编号：1
 * 描述：通过拍照方式添加发单图片时，只能通过拍照添加一张
 * 方案：拍照后在提示照片在相册里，引导前去选择
 */

/**
 * 编号：2
 * 描述：提现密码为空时，到了提现页面就只能通过后台返回未设置密码，体验很差
 * 方案：无
 */

/**
 * 编号：3
 * 描述：师傅端待评价订单应该放在已完成里面
 * 方案：无
 */

/**
 * 编号：4
 * 描述：余额支付是否需要输入密码的问题
 * 方案：无
 */

/**
 * 编号：5
 * 描述：某次余额支付完以后进度条还在转，没有消失
 * 方案：无
 */

/**
 * 编号：6
 * 描述：搜索完配件商品以后回来应该给这个商品加一，但是tableView.reloadData()调用后崩溃，因此先注释掉
 * 方案：无
 */

/**
 * 编号：7
 * 描述：配件商品的排序如果有相同的话，搜索就会出错
 * 方案：无
 */

/**
 * 编号：8
 * 描述：图片上传那里只实现了最基本的功能，连断点续传都没有，如果你看到这句话，优化的重任就交给你了！！
 * 方案：无
 */

/**
 * 编号：9
 * 描述：师傅端订单详情页面布局是有警告的
 * 方案：无
 */

/**
 * 编号：10
 * 描述：订单列表页面刚加载的时候顶部有一块空白区域，点一下就消失了
 * 方案：无
 */
